app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)
    if @admin.save
---
INSERT INTO "admins" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @admin = Admin.find(params[:id])
    if @admin.update(admin_params)
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 1 LIMIT 1
UPDATE "admins" SET "password_digest" = ?, "updated_at" = ? WHERE "admins"."id" = 1  [["password_digest", "$2a$10$Syg6kaKrVor04ydVnAKazeZI2aWR1EhP4y4JHIrygy9ZLUXc1s6Oq"], ["updated_at", Mon, 23 Sep 2013 00:01:15 UTC +00:00]]

  def destroy
    @admin = Admin.find(params[:id])
    @admin.destroy
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 2 LIMIT 1
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 2]]