app/controllers/news_items_controller.rb

  def index
    @news_page = true
    @news_items = NewsItem.order("created_at DESC").page params[:page]
---
SELECT "news_items".* FROM "news_items" ORDER BY "news_items".created_at ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "news_items"

  def edit
    @news_item = NewsItem.find(params[:id])
---
SELECT "news_items".* FROM "news_items" WHERE "news_items"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @news_item = NewsItem.new(news_items_params)
    @news_item.admin_name = current_admin.name
    # admin name for news item will persist even if admin is later deleted
    if params[:preview]
      @preview = true
      render "new"
    elsif @news_item.save
---
INSERT INTO "news_items" ("admin_name", "created_at", "entry", "heading", "updated_at") VALUES (?, ?, ?, ?, ?)  [["admin_name", "Bennett"], ["created_at", Mon, 23 Sep 2013 01:42:37 UTC +00:00], ["entry", "There"], ["heading", "Hi"], ["updated_at", Mon, 23 Sep 2013 01:42:37 UTC +00:00]]

  def update
    @news_item= NewsItem.find(params[:id])
    if params[:preview]
      @preview = true
      render "edit"
    elsif @news_item.update(news_items_params)
---
SELECT "news_items".* FROM "news_items" WHERE "news_items"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "news_items" SET "heading" = ?, "entry" = ?, "updated_at" = ? WHERE "news_items"."id" = 14  [["heading", "Howdy"], ["entry", "<b>There you go!</b>"], ["updated_at", Mon, 23 Sep 2013 03:49:24 UTC +00:00]]

  def destroy
    @news_item = NewsItem.find(params[:id])
    @news_item.destroy
---
SELECT "news_items".* FROM "news_items" WHERE "news_items"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "news_items" WHERE "news_items"."id" = ?  [["id", 3]]