app/controllers/sessions_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."name" = 'Bennett' LIMIT 1
---
  def create
    admin = Admin.find_by name: params[:name]