app/controllers/shows_items_controller.rb

SELECT "shows_items".* FROM "shows_items" WHERE (date <= '2013-09-24 06:59:59.999999') ORDER BY date DESC
SELECT "shows_items".* FROM "shows_items" WHERE (date <= '2013-09-24 06:59:59.999999') ORDER BY date DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "shows_items" WHERE (date <= '2013-09-24 06:59:59.999999')
---
  def index
    @upcoming_shows = ShowsItem.where(["date >= ?",
      Time.now]).order("date")
    @past_shows = ShowsItem.where(["date <= ?",
      Time.now]).order("date DESC").page params[:page]

SELECT "shows_items".* FROM "shows_items" WHERE "shows_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @shows_item = ShowsItem.find(params[:id])

INSERT INTO "shows_items" ("city", "created_at", "date", "extra", "name", "state", "updated_at", "webpage") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @shows_item = ShowsItem.new(shows_items_params)
    if @shows_item.save

SELECT "shows_items".* FROM "shows_items" WHERE "shows_items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "shows_items" SET "name" = ?, "date" = ?, "updated_at" = ? WHERE "shows_items"."id" = 7  [["name", "Club Paris"], ["date", Thu, 23 May 2013 00:00:00 UTC +00:00], ["updated_at", Tue, 24 Sep 2013 05:33:28 UTC +00:00]]
---
  def update
    @shows_item= ShowsItem.find(params[:id])
    if @shows_item.update(shows_items_params)

SELECT "shows_items".* FROM "shows_items" WHERE "shows_items"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "shows_items" WHERE "shows_items"."id" = ?  [["id", 1]]
---
  def destroy
    @shows_item = ShowsItem.find(params[:id])
    @shows_item.destroy